DemoAccessTokenClient/DemoTokenClient/Connected Services/SF1520/PersonBaseDataExtendedService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://serviceplatformen.dk/xml/wsdl/soap11/CPR/PersonBaseDataExtended/5/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:spf="http://serviceplatformen.dk/xml/schemas/ServiceplatformFault/1/" name="PersonBaseDataExtendedService" targetNamespace="http://serviceplatformen.dk/xml/wsdl/soap11/CPR/PersonBaseDataExtended/5/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:import namespace="http://serviceplatformen.dk/xml/wsdl/soap11/Security/Policy" location="policies.wsdl" />
  <wsdl:import namespace="http://serviceplatformen.dk/xml/schemas/ServiceplatformFault/1/" location="../../sp/ServiceplatformFaultMessage_1.wsdl" />
  <wsdl:types>
    <xsd:schema targetNamespace="http://serviceplatformen.dk/xml/wsdl/soap11/CPR/PersonBaseDataExtended/5/">
      <xsd:include schemaLocation="../../PersonBaseDataExtendedServiceMsg.xsd" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="PersonLookupRequestMessage">
    <wsdl:part name="request" element="tns:PersonLookupRequest" />
  </wsdl:message>
  <wsdl:message name="PersonLookupResponseMessage">
    <wsdl:part name="response" element="tns:PersonLookupResponse" />
  </wsdl:message>
  <wsdl:portType name="PersonBaseDataExtendedPortType">
    <wsdl:operation name="PersonLookup">
      <wsdl:input message="tns:PersonLookupRequestMessage" />
      <wsdl:output message="tns:PersonLookupResponseMessage" />
      <wsdl:fault name="ServiceplatformFault" message="spf:ServiceplatformFault" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="PersonBaseDataExtendedBinding" type="tns:PersonBaseDataExtendedPortType">
    <wsp:PolicyReference URI="policies.wsdl#ServiceplatformBindingPolicy" />
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="PersonLookup">
      <soap:operation soapAction="http://serviceplatformen.dk/xml/wsdl/soap11/CPR/PersonBaseDataExtended/5/PersonLookup" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
      <wsdl:fault name="ServiceplatformFault">
        <soap:fault use="literal" name="ServiceplatformFault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="PersonBaseDataExtendedService">
    <wsdl:port name="PersonBaseDataExtendedPort" binding="tns:PersonBaseDataExtendedBinding">
      <soap:address location="https://localhost:8080/service/CPR/PersonBaseDataExtended/5" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>